sample-soap/src/data/register.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fuse="http://fuse.box.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <fuse:register>
         <!--Optional:-->
         <fuse:arg0>
            <!--Optional:-->
            <firstname>A</firstname>
            <!--Optional:-->
            <lastname>B</lastname>
            <!--Optional:-->
            <username>coy</username>
         </fuse:arg0>
      </fuse:register>
   </soapenv:Body>
</soapenv:Envelope>